In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:koushik16@localhost/

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%%sql
use sys;
drop table if exists EmployeeSalaries;
CREATE TABLE EmployeeSalaries (
    EmployeeID INT,
    EmployeeName VARCHAR(100),
    Salary DECIMAL(10, 2),
    Year INT
);
INSERT INTO EmployeeSalaries (EmployeeID, EmployeeName, Salary, Year) VALUES
(1, 'Alice', 5000, 2021),
(1, 'Alice', 5500, 2022),
(1, 'Alice', 6000, 2023),
(1, 'Alice', 6500, 2024),
(1, 'Alice', 7000, 2025),
(2, 'Bob', 4500, 2023),
(2, 'Bob', 4800, 2024),
(3, 'Charlie', 4000, 2023),
(3, 'Charlie', 4200, 2024),
(4, 'David', 4600, 2023),
(4, 'David', 4700, 2024),
(5, 'Eva', 5200, 2023),
(5, 'Eva', 5400, 2024);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.
13 rows affected.

[]

In [20]:
%%sql
select *,
first_value (Salary) over (partition by EmployeeID order by Year 
                        ) as firstsalary,
 first_value (Salary) over (partition by EmployeeID order by Year 
                         )- salary as diff
from EmployeeSalaries;

 * mysql+mysqlconnector://root:***@localhost/
13 rows affected.

[(1, 'Alice', Decimal('5000.00'), 2021, Decimal('5000.00'), Decimal('0.00')),
 (1, 'Alice', Decimal('5500.00'), 2022, Decimal('5000.00'), Decimal('-500.00')),
 (1, 'Alice', Decimal('6000.00'), 2023, Decimal('5000.00'), Decimal('-1000.00')),
 (1, 'Alice', Decimal('6500.00'), 2024, Decimal('5000.00'), Decimal('-1500.00')),
 (1, 'Alice', Decimal('7000.00'), 2025, Decimal('5000.00'), Decimal('-2000.00')),
 (2, 'Bob', Decimal('4500.00'), 2023, Decimal('4500.00'), Decimal('0.00')),
 (2, 'Bob', Decimal('4800.00'), 2024, Decimal('4500.00'), Decimal('-300.00')),
 (3, 'Charlie', Decimal('4000.00'), 2023, Decimal('4000.00'), Decimal('0.00')),
 (3, 'Charlie', Decimal('4200.00'), 2024, Decimal('4000.00'), Decimal('-200.00')),
 (4, 'David', Decimal('4600.00'), 2023, Decimal('4600.00'), Decimal('0.00')),
 (4, 'David', Decimal('4700.00'), 2024, Decimal('4600.00'), Decimal('-100.00')),
 (5, 'Eva', Decimal('5200.00'), 2023, Decimal('5200.00'), Decimal('0.00')),
 (5, 'Eva', Decimal('5400.00'), 2024, Decimal('5200.00'), Decimal('-200.00'))]